spec/dummy/app/controllers/records_controller.rb

INSERT INTO "records" ("field1", "field2") VALUES (?, ?)  [["field1", #<BigDecimal:32a71e8,'0.122333E6',9(18)>], ["field2", #<BigDecimal:32a7198,'0.44445E4',18(18)>]]
---
  def create
    Record.create record_params

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "records" SET "field1" = ?, "field2" = ? WHERE "records"."id" = 1  [["field1", #<BigDecimal:2269010,'0.332211E6',9(18)>], ["field2", #<BigDecimal:2268f48,'0.7766554E6',18(18)>]]
---
  def update
    Record.find(params[:id]).update_attributes record_params